import React, { Component } from 'react'
import Navbar from '../components/headbar'
import Credit from '../components/credit'
import '../style/home.scss';


class AboutSharepro extends Component{
    constructor(props){
        super(props)
        this.state = {
        }
    }

    render(){
        return (
            <div>
            <Navbar/>
              <div className="privacypolicy" >
                <h1>About SharePro</h1>
                <p/>
                <p>เนื่องจากสถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบังนั้นมีนักศึกษาใหม่ๆเพิ่มขึ้นในทุก ๆ ปีและกิจกรรมที่จะสามารถทำให้นักศึกษาของแต่ละคณะหรือแม้กระทั้งคณะเดียวกันมารู้จักกันได้ก็มีน้อยมาก  นอกจากนี้บริเวณรอบสถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบังยังมีร้านอาหารและแหล่งอำนายความสะดวกที่มากมายมีทั้งที่เป็นที่รู้จัก , ไม่รู้จัก  และบ้างร้านก็เป็นร้านเปิดใหม่  ทางกลุ่มผู้จัดทำจึงได้สร้างแหล่งที่จะทำให้ทุกคนสามารถเข้ามาหาข้อมูลร้านอาหารและบริการต่าง ๆ ได้  ในบางครั้งที่ผู้ใช้งานต้องการเพื่อนในการออกไปทานอาหารหรือแม้กระทั้งทำกิจกรรมต่าง ๆ ตามที่เว็บไซต์ได้มีประกาศก็สามารถตั้งกระทู้เพื่อชักชวนผู้ใช้งานคนอื่น ๆ เข้าร่วมได้และผู้ใช้งานท่านอื่นก็สามารถเข้าไปตอบกระทู้ที่สนใจได้  โดยเว็บไซต์ sharepro.com ก็ได้เพิ่มฟังก์ชันในการค้นหาเพื่อนใหม่ๆในเว็บไซต์ด้วยการนำผลการทดสอบบุคลิกภาพ(MBTI)มาใช้ร่วมด้วย เนื่องจากมีผลการวิจัยเกี่ยวกับผลการทดสอบบุคลิกภาพ(MBTI)มีผลต่อความเข้ากันได้ระหว่างบุคคล โดยทางเว็บไซต์ของเราได้มีการแบ่งฟังก์ชันให้ 2 แบบ คือให้ผู้ใช้งานสามารถติดต่อได้กับผู้ใช้งานที่ผลการทดสอบบุคลิกภาพ(MBTI)ที่มีผลการวิจัยว่าสามารถเข้ากันได้ดีเท่านั้น  หรือ เลือกติดต่อกับผู้ใช้งานได้ทั้งหมดโดยไม่สนความเหมาะสมของผลการทดสอบบุคลิกภาพ(MBTI)</p>
                <p/>
                </div>
                <Credit/>
            </div>
        )

    }
}
export default AboutSharepro
